metalapi.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-04-03 Mon 01:08 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Metal Graphics API</title>
<meta name="author" content="Sean Zhang" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Metal Graphics API
<br />
<span class="subtitle">Using Metal for Compute</span>
</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgd3d242d">1. Introduction</a></li>
<li><a href="#org5c4c901">2. Project Structure</a>
<ul>
<li><a href="#orgafcbd4a">2.1. Source Files</a></li>
<li><a href="#org21c46fd">2.2. Building Project</a></li>
</ul>
</li>
<li><a href="#org332f75a">3. Initialization</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgd3d242d" class="outline-2">
<h2 id="orgd3d242d"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
I wanted to use the GPU for some intesive tasks in C++. Here is a note to self on how to do it.
To make it clear, this is my first time working with CMake.
</p>
</div>
</div>

<div id="outline-container-org5c4c901" class="outline-2">
<h2 id="org5c4c901"><span class="section-number-2">2.</span> Project Structure</h2>
<div class="outline-text-2" id="text-2">
<p>
We will need the metal-cpp library from Apple first. Then, place that into a folder called
<code>lib</code>, under the root of the project. <br />
Then, we will use cmake to generate build files for the project.
This is all new to me, so I decided to quickly ask Bing chat what it thought was
a good idea:
</p>
<pre class="example">
Here are some steps to set up a basic CMake that includes the Metal APIs:
1. First, you need to install CMake on your system. You can download it from the official website.
2. Next, you need to create a new CMake project and add the Metal APIs to it. You can do this by adding the following lines to your CMakeLists.txt file:

```
cmake_minimum_required(VERSION 3.0)
project(MyMetalProject)

set(CMAKE_CXX_STANDARD 14)

find_library(METAL_LIBRARY Metal)
find_library(CORE_FOUNDATION_LIBRARY CoreFoundation)

add_executable(MyMetalProject main.cpp)

target_link_libraries(MyMetalProject ${METAL_LIBRARY} ${CORE_FOUNDATION_LIBRARY})
```

3. Now you can create a new file called main.cpp and add some code that uses the Metal APIs.

4. Finally, you can build your project using CMake and run it.

I hope this helps! Let me know if you have any other questions.
</pre>
</div>

<div id="outline-container-orgafcbd4a" class="outline-3">
<h3 id="orgafcbd4a"><span class="section-number-3">2.1.</span> Source Files</h3>
<div class="outline-text-3" id="text-2-1">
<p>
We will put the code under a folder called <code>src/</code>. We name our starting point <code>main.cpp</code>, but you can
name it something else if you please. Just make sure you update the Cmake file.
</p>
</div>
</div>

<div id="outline-container-org21c46fd" class="outline-3">
<h3 id="org21c46fd"><span class="section-number-3">2.2.</span> Building Project</h3>
<div class="outline-text-3" id="text-2-2">
<p>
We will need to modify our CMakeLists a bit, since we want our source code
to be in the <code>src/</code> folder. Specifically, our add<sub>executable</sub> should have the
path <code>./src/main.cpp</code>.
</p>
<div class="org-src-container">
<pre class="src src-makefile">cmake_minimum_required <span style="color: #3a81c3;">(</span>VERSION 3.20<span style="color: #3a81c3;">)</span>
project <span style="color: #3a81c3;">(</span>compute_sumarrays<span style="color: #3a81c3;">)</span>

set<span style="color: #3a81c3;">(</span>CMAKE_CXX_STANDARD 17<span style="color: #3a81c3;">)</span>
set<span style="color: #3a81c3;">(</span>CMAKE_CXX_FLAGS <span style="color: #2d9574;">"${</span><span style="color: #715ab1;">CMAKE_CXX_FLAGS</span><span style="color: #2d9574;">} -Wall -Wextra -Werror"</span><span style="color: #3a81c3;">)</span>

find_library<span style="color: #3a81c3;">(</span>METAL_LIBRARY Metal REQUIRED<span style="color: #3a81c3;">)</span>
find_library<span style="color: #3a81c3;">(</span>CORE_FOUNDATION_LIBRARY CoreFoundation REQUIRED<span style="color: #3a81c3;">)</span>

add_executable<span style="color: #3a81c3;">(</span>compute_sumarrays
  ./src/main.cpp
<span style="color: #3a81c3;">)</span>

target_link_libraries<span style="color: #3a81c3;">(</span>compute_sumarrays
  $<span style="color: #6c3163;">{</span><span style="color: #715ab1;">METAL_LIBRARY</span><span style="color: #6c3163;">}</span>
  $<span style="color: #6c3163;">{</span><span style="color: #715ab1;">CORE_FOUNDATION_LIBRARY</span><span style="color: #6c3163;">}</span>
<span style="color: #3a81c3;">)</span>
</pre>
</div>

<p>
Now that your <code>CMakeLists.txt</code> file is set up, here is what to do next:
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #2aa1ae; background-color: #ecf3ec;"># you should be in the root of your project</span>
<span style="color: #3a81c3; font-weight: bold;">pwd</span>

<span style="color: #2aa1ae; font-weight: bold;">mkdir</span> build
<span style="color: #3a81c3; font-weight: bold;">cd</span> build
<span style="color: #2aa1ae; background-color: #ecf3ec;"># start configuration, 2nd argument is</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># the path to the CMakeLists.txt directory.</span>
<span style="color: #2aa1ae; font-weight: bold;">cmake</span> ../
</pre>
</div>

<p>
This will generate a Makefile in your <code>build</code> directory.
You do not need to do anything to that file. When ready to
build, just type <code>make</code> in that directory, and it will
create an executable which will have the same name as your project.
</p>
</div>
</div>
</div>

<div id="outline-container-org332f75a" class="outline-2">
<h2 id="org332f75a"><span class="section-number-2">3.</span> Initialization</h2>
<div class="outline-text-2" id="text-3">
<p>
Once all the structure is there, we move on to the main file of our project.
For this tutorial, I will assume all of our code is inside that file.
</p>

<div class="org-src-container">
<pre class="src src-C++" id="orgd119424"><span style="color: #6c3163;">#include</span> <span style="color: #2d9574;">&lt;iostream&gt;</span>

<span style="color: #3a81c3;">int</span> <span style="color: #6c3163; font-weight: bold;">main</span><span style="color: #3a81c3; background-color: #fbf8ef;">()</span> <span style="color: #3a81c3; background-color: #fbf8ef;">{</span>
  <span style="color: #ba2f59; font-weight: bold;">std</span>::cout <span style="color: #3a81c3; font-weight: bold;">&lt;&lt;</span> <span style="color: #2d9574;">"hi world"</span> <span style="color: #3a81c3; font-weight: bold;">&lt;&lt;</span> <span style="color: #ba2f59; font-weight: bold;">std</span>::endl<span style="color: #655370; background-color: #fbf8ef;">;</span>

  <span style="color: #3a81c3; font-weight: bold;">return</span> <span style="color: #4e3163;">0</span><span style="color: #655370; background-color: #fbf8ef;">;</span>
<span style="color: #3a81c3; background-color: #fbf8ef;">}</span>
</pre>
</div>

<pre class="example">
hi world
</pre>
</div>
</div>
</div>
</body>
</html>
